# Pandas  - 2 data structures -series and dataframe

In [1]:
import pandas as pd

In [2]:
# pandas series is like a one dimensional array, or a list of columns (only one column)

# pandas series

In [4]:
series1 = pd.Series([1,2,3,"string", -34, 5.6])
print(series1)

0         1
1         2
2         3
3    string
4       -34
5       5.6
dtype: object

In [5]:
#indexing an series

In [13]:
i =['a','b','c','d','e','f']
series2= pd.Series( [1,2,3,"string",-34,5.6], index = i)

series2

In [14]:
series2

a         1
b         2
c         3
d    string
e       -34
f       5.6
dtype: object

In [16]:
series2['b']

2

In [18]:
series2['d']

'string'

In [19]:
#here above we accessed a particular index value

In [20]:
# now assign dictionary values to series

In [23]:
 series3= pd.Series({'a':10,'b':20,'c':30,'d':40})

series3

In [25]:
series3['b']

20

In [27]:
series4 = pd.Series([34,45,65,13,23,42,10,20])

In [29]:
series4

0    34
1    45
2    65
3    13
4    23
5    42
6    10
7    20
dtype: int64

In [38]:
# performing logical operations on datframes is also possible

# Pandas Dataframe

In [39]:
# pandas Dataframe is used when we have multiple columns

In [40]:
import pandas as pd

In [44]:
col1 =['yash','raj','ram','shivani', 'neha']
col2 = [23,34,20,18,35]

In [45]:
df = pd.DataFrame({'Names':col1 , 'Age':col2 } )

In [46]:
df

     Names  Age
0     yash   23
1      raj   34
2      ram   20
3  shivani   18
4     neha   35

In [47]:
df.head(2)          # get first 2 rows

  Names  Age
0  yash   23
1   raj   34

In [48]:
df.tail(3)           # get 3 rows from bottom/last

     Names  Age
2      ram   20
3  shivani   18
4     neha   35

In [50]:
df.columns                # here we get the column names

Index(['Names', 'Age'], dtype='object')

In [56]:
df.columns = ['Student', 'Marks']             # here we assign new coluns names
df

   Student  Marks
0     yash     23
1      raj     34
2      ram     20
3  shivani     18
4     neha     35

In [57]:
df.index = ['a','b','c','d','e']               # here we assign new row index
df

   Student  Marks
a     yash     23
b      raj     34
c      ram     20
d  shivani     18
e     neha     35

In [58]:
df.Marks                             #here we get only one col from table

a    23
b    34
c    20
d    18
e    35
Name: Marks, dtype: int64

In [60]:
df['Marks']

a    23
b    34
c    20
d    18
e    35
Name: Marks, dtype: int64

In [61]:
del df['Student']                    # here we deleted the Student colum and only marks remain there in df
df

   Marks
a     23
b     34
c     20
d     18
e     35

In [63]:
col1 =['yash','raj','ram','shivani', 'neha']
col2 = [23,34,20,18,35]
col3 = ['A','B','B','D','A']
df1 = pd.DataFrame( {'Names': col1 ,'Age' : col2 , 'Grade' :col3 })
df1

     Names  Age Grade
0     yash   23     A
1      raj   34     B
2      ram   20     B
3  shivani   18     D
4     neha   35     A

In [64]:
# here we got the combo of 3 datas into one frame

In [65]:
df. iloc[ 1:4]

   Marks
b     34
c     20
d     18

In [66]:
df. iloc[ 1:4 : 2]

   Marks
b     34
d     18

In [68]:
df. iloc[ :, :]

   Marks
a     23
b     34
c     20
d     18
e     35

In [71]:
df1 = df1[df1['Age'] > 30]

In [72]:
df1

  Names  Age Grade
1   raj   34     B
4  neha   35     A

In [74]:
df1 = df1[df1['Grade'] == 'A']

In [75]:
df1

  Names  Age Grade
4  neha   35     A

In [81]:
# acces multiple cols

In [3]:
import pandas as pd

In [4]:
col1 =['yash','raj','ram','shivani', 'neha']
col2 = [23,34,20,18,35]
col3 = ['A','B','B','D','A']
df2 = pd.DataFrame( {'Names': col1 ,'Age' : col2 , 'Grade' :col3 })
df2

     Names  Age Grade
0     yash   23     A
1      raj   34     B
2      ram   20     B
3  shivani   18     D
4     neha   35     A

In [5]:
#converting datframe to csv

In [6]:
# syntax   dtaframe_name.to_csv('csv filename.csv')

In [30]:
 #

In [29]:
 # df2 = df2.to_csv('StudentGrade.csv', index= False)

In [31]:
#import os
#os.listdir()

In [32]:
df3=pd.DataFrame( {'Student': col1 ,'Age' : col2 , 'Grade' :col3 })
df3

   Student  Age Grade
0     yash   23     A
1      raj   34     B
2      ram   20     B
3  shivani   18     D
4     neha   35     A

In [33]:
df3.to_csv('StudentDetails', index= False)                   #converting datframe to csv and index =false means remove index col

In [34]:
import os
os.listdir()                     # checkng all files present in directory

['.conda',
 '.condarc',
 '.continuum',
 '.idlerc',
 '.ipynb_checkpoints',
 '.ipython',
 '.jupyter',
 '.matplotlib',
 '.ms-ad',
 '.spyder-py3',
 '.vscode',
 '3D Objects',
 'anaconda3',
 'AppData',
 'Application Data',
 'Contacts',
 'Cookies',
 'Desktop',
 'Documents',
 'Downloads',
 'Favorites',
 'first_built in functions.ipynb',
 'first_class_objects.ipynb',
 'first_functions userdefined.ipynb',
 'first_import pandas numpy.ipynb',
 'first_python_conditional statements.ipynb',
 'first_python_list.ipynb',
 'first_python_set.ipynb',
 'first_python_tuple.ipynb',
 'IntelGraphicsProfiles',
 'INTERMEDIATE TUTORIAL.ipynb',
 'Links',
 'Local Settings',
 'Microsoft',
 'MicrosoftEdgeBackups',
 'Music',
 'My Documents',
 'NetHood',
 'NTUSER.DAT',
 'ntuser.dat.LOG1',
 'ntuser.dat.LOG2',
 'NTUSER.DAT{53b39e87-18c4-11ea-a811-000d3aa4692b}.TxR.0.regtrans-ms',
 'NTUSER.DAT{53b39e87-18c4-11ea-a811-000d3aa4692b}.TxR.1.regtrans-ms',
 'NTUSER.DAT{53b39e87-18c4-11ea-a811-000d3aa4692b}.TxR.2.regtrans-ms',
 'NTUSER.DAT{53b39e87-18c4-11ea-a811-000d3aa4692b}.TxR.blf',
 'NTUSER.DAT{53b39e88-18c4-11ea-a811-000d3aa4692b}.TM.blf',
 'NTUSER.DAT{53b39e88-18c4-11ea-a811-000d3aa4692b}.TMContainer00000000000000000001.regtrans-ms',
 'NTUSER.DAT{53b39e88-18c4-11ea-a811-000d3aa4692b}.TMContainer00000000000000000002.regtrans-ms',
 'ntuser.ini',
 'OneDrive',
 'opera autoupdate',
 'Pandas .ipynb',
 'Pictures',
 'PrintHood',
 'Recent',
 'Saved Games',
 'Searches',
 'SendTo',
 'Start Menu',
 'Student Grade',
 'StudentDetails',
 'Templates',
 'TeXworks',
 'Videos']

In [35]:
# here we can see 'StudentDetails'  is imported

In [44]:
#df3 = pd.read_csv('StudentDetails.csv')
df3

   Student  Age Grade
0     yash   23     A
1      raj   34     B
2      ram   20     B
3  shivani   18     D
4     neha   35     A

# Groupby

In [53]:
col1 =['yash','raj','yash','raj', 'raj']
col2 = [23,34,20,18,35]
col3 = ['Maths','science','economics','history','geography']
df4 = pd.DataFrame( {'Names': col1 ,'Marks' : col2 , 'Subjects' :col3 })
df4

  Names  Marks   Subjects
0  yash     23      Maths
1   raj     34    science
2  yash     20  economics
3   raj     18    history
4   raj     35  geography

In [46]:
# who have scored top marks

In [59]:
df4.groupby('Names').agg('sum')

       Marks
Names
raj       87
yash      43

In [55]:
# here we see there total or aggreate of marks grpouped by names

In [60]:
df4.groupby('Names').agg('mean')

       Marks
Names
raj     29.0
yash    21.5

In [61]:
# here we see there is average of marks grpouped by names

In [63]:
df4.groupby('Names').agg('max')

       Marks   Subjects
Names
raj       35    science
yash      23  economics

In [64]:
df4

  Names  Marks   Subjects
0  yash     23      Maths
1   raj     34    science
2  yash     20  economics
3   raj     18    history
4   raj     35  geography

In [66]:
df4.iloc[2]                     # using index

Names            yash
Marks              20
Subjects    economics
Name: 2, dtype: object

In [70]:
df4.loc[2][['Marks','Subjects']]               # using labels

Marks              20
Subjects    economics
Name: 2, dtype: object

In [71]:
df4.loc[1]

Names           raj
Marks            34
Subjects    science
Name: 1, dtype: object

In [76]:
col4= [1,2,3,4]
df5= pd.DataFrame({'No.s':col4})
col5= ['bat','ball','spinner','puzzle']
df6= pd.DataFrame({'Toys': col5})

# concatenate

In [77]:
# while concatenating two dataframes horizontly there should be equal no. of rows

In [78]:
# while concatenating two dataframes vertically then it should have equal no. of columns

In [79]:
# axis= 0 for vertically concatenate and axis= 1 for horizontal concatenate

In [80]:
df6 = pd.concat([df5,df6], axis =1 )

In [81]:
df6

   No.s     Toys
0     1      bat
1     2     ball
2     3  spinner
3     4   puzzle

In [88]:
df6 = pd.concat([df5,df6], axis =1 ,ignore_index= True )

In [89]:
df6

   0  1  2  3        4
0  1  1  1  1      bat
1  2  2  2  2     ball
2  3  3  3  3  spinner
3  4  4  4  4   puzzle

# Pandas DateRange

In [90]:
#syntax pd.date_range(start_time,end_time) 
# YEAR-MNTH-DATE      HRS:MIM:SEC

In [92]:
pd.date_range('2022.01.01','2022.01.05', freq='D' )

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05'],
              dtype='datetime64[ns]', freq='D')

In [93]:
# HERE WE HAVE CREATED 5 DATES AS WE HAVE FREQ AS DAYS ( D )

In [95]:
pd.date_range('2022.01.01 00:01:00','2022.01.01 00:20:00', freq='6T' )

DatetimeIndex(['2022-01-01 00:01:00', '2022-01-01 00:07:00',
               '2022-01-01 00:13:00', '2022-01-01 00:19:00'],
              dtype='datetime64[ns]', freq='6T')

In [96]:
# here time interval is ending in 20 min divided into 6 time intervals ( 6T)

In [100]:
pd.date_range('2022.01.01 00:01:00','2022.01.01 00:20:00', periods = 5)

DatetimeIndex(['2022-01-01 00:01:00', '2022-01-01 00:05:45',
               '2022-01-01 00:10:30', '2022-01-01 00:15:15',
               '2022-01-01 00:20:00'],
              dtype='datetime64[ns]', freq=None)

In [101]:
#here 5 eqaul time intervals

In [102]:
#now print working days/ business days, skip weekends

In [108]:
pd.date_range(start='2022.01.01', end ='2022.01.10', freq='B' )

DatetimeIndex(['2022-01-03', '2022-01-04', '2022-01-05', '2022-01-06',
               '2022-01-07', '2022-01-10'],
              dtype='datetime64[ns]', freq='B')

In [109]:
# here date 8,9 is skipped

In [111]:
pd.date_range(start='2022.01.01', end ='2022.02.10', freq='W' )

DatetimeIndex(['2022-01-02', '2022-01-09', '2022-01-16', '2022-01-23',
               '2022-01-30', '2022-02-06'],
              dtype='datetime64[ns]', freq='W-SUN')

In [112]:
#IT CUTS DATE INTO WEEKS

In [113]:
pd.date_range(start='2022.01.01', end ='2022.05.01', freq='M' )

DatetimeIndex(['2022-01-31', '2022-02-28', '2022-03-31', '2022-04-30'], dtype='datetime64[ns]', freq='M')

In [114]:
#IT CUTS DATE INTO MONTH

In [115]:
pd.date_range(start='2022.01.01', end ='2022.11.01', freq='q' )

DatetimeIndex(['2022-03-31', '2022-06-30', '2022-09-30'], dtype='datetime64[ns]', freq='Q-DEC')

In [ ]:
#IT CUTS DATE INTO QUARTERS